/*Напишите программу, которая читает целочисленные значения из входного потока в массив, записанных в одну строчку через пробел.
Чтение происходит до тех пор, пока либо не закончатся данные, либо не будет прочитано 10 чисел.
После этого выполните проверку: если прочитанные числа неотрицательны (больше или равны 0) и нечетны, то выведите в консоль число 1,
иначе - число 0.
Попробуйте реализовать эту программу без применения условных операторов.*/

#include <stdio.h>

int main() {
    int numbers[10]; // Массив для хранения чисел
    int index = 0; // Индекс для заполнения массива

    // Чтение чисел из входного потока
    while (index < 10 && scanf("%d", &numbers[index]) == 1) {
        index++;
    }

    int isNeotrAndNechet = 1; // Флаг, показывающий, все ли числа неотрицательные и нечетные

    // Проверка чисел на нечетность и неотрицательность
    for (int i = 0; i < index; ++i) {
        // Если число отрицательное или четное, изменяем флаг
        if (numbers[i] < 0 || numbers[i] % 2 == 0) {
            isNeotrAndNechet = 0;
            break; // Нет необходимости проверять дальше, уже не соответствует условиям
        }
    }

    printf("%d\n", isNeotrAndNechet);

    return 0;
}

/*Не получилось реализовать без IF*/



