/*Напишите программу, которая читает в массив вещественные числа из входного потока, записанные каждое с новой строки.
Чтение происходит до тех пор, пока не будет достигнут конец данных.
Гарантируется, что максимальное количество чисел не более 20.
Вычислите среднее арифметическое прочитанных чисел и выведите в консоль полученное значение с точностью до сотых.*/

#include <stdio.h>

int main() {
    double numbers[20]; // Массив для хранения чисел
    int count = 0; // Количество считанных чисел
    double sum = 0; // Сумма считанных чисел

    // Чтение чисел из входного потока
    while (count < 20 && scanf("%lf", &numbers[count]) == 1) {
        sum += numbers[count];
        count++;
    }

    // Проверка на наличие чисел для избежания деления на 0
    if (count > 0) {
        double average = sum / count; // Вычисление среднего арифметического
        printf("%.2lf\n", average); // Вывод среднего арифметического с точностью до сотых
    } else {
        printf("Не были введены числа.\n");
    }

    return 0;
}




