/*Напишите программу, которая читает из входного потока целое число в переменную value типа int.
Каждые два байта этой переменной следует обработать по следующему алгоритму:
1. Представить два байта в виде целого числа.
2. Увеличить каждое полученное двухбайтовое число на единицу.
3. Увеличенное значение снова побайтно перенести в соответствующие ячейки переменной value.
Полученное значение переменной value вывести в консоль в виде одного целого числа.
P. S. При написании программы гарантируется: char = 1 байт; short = 2 байта; int = 4 байта; double = 8 байт.*/

#include <stdio.h>

int main(void) {
    int value;
    
    scanf("%d", &value); // Чтение входного целого числа
    
    // Переменная для хранения обработанных двухбайтовых чисел
    short num;
    
    // Обработка каждых двух байт переменной value
    for (int i = 0; i < sizeof(value); i += 2) {
        // Представление двух байт в виде целого числа
        num = *((short *)(&value) + (i / 2));
        
        // Увеличение полученного двухбайтового числа на единицу
        num++;
        
        // Побайтная передача увеличенного значения в соответствующие ячейки переменной value
        *((short *)(&value) + (i / 2)) = num;
    }
    
    // Вывод обработанного значения переменной value в консоль
    printf("%d\n", value);
    
    return 0;
}








