/*Продолжите программу. Используя указатели p1 и p2 определите сколько переменных типа double уместится в памяти,
начиная с адреса p1 и заканчивая адресом p2 (не включая ячейку с адресом p2).
Выведите вычисленное число переменных в консоль в виде целого числа.*/

#include <stdio.h>

int main(void)
{
    int a, b;

    scanf("%d; %d", &a, &b);

    void* p1 = (void *)a;
    void* p2 = (void *)b;

    // Размер переменной типа double (в байтах)
    size_t double_size = sizeof(double);

    // Разность адресов p2 и p1, деленная на размер double, даст количество double-переменных между ними
    int num_doubles = ((char *)p2 - (char *)p1) / double_size;

    // Выводим вычисленное число переменных в консоль в виде целого числа
    printf("%d\n", num_doubles);

    return 0;
}









