/*Напишите программу, которая читает из входного потока целое число в переменную count типа int.
В каждом байте переменной count нужно включить 3-й и 0-й биты (нумерация бит в байте: 7, 6, 5, 4, 3, 2, 1, 0).
Вывести в консоль полученное значение count в виде одного целого числа.*/

#include <stdio.h>

int main(void) {
    int count;
    
    scanf("%d", &count); // Чтение целого числа из входного потока
    
    int result = 0; // Переменная для хранения результата
    
    // Установка битов 3 и 0 в каждом байте переменной count
    for (int i = 0; i < sizeof(count); ++i) {
        // Сохраняем значение текущего байта
        unsigned char byte = (count >> (i * 8)) & 0xFF;
        
        // Устанавливаем биты 3 и 0 в байте
        byte |= (1 << 3) | 1;
        
        // Обновляем результат
        result |= byte << (i * 8);
    }
    
    printf("%d\n", result); 
    
    return 0;
}

/*В этой программе:

1.Считывается целое число из входного потока в переменную count.

2.Создается переменная result, в которой будет храниться результат.

3.В цикле для каждого байта переменной count:
	- Получается значение текущего байта.
	- Устанавливаются биты 3 и 0 в этом байте.
	- Обновляется значение result, учитывая изменения в текущем байте.

4. Выводится результат в консоль.*/







