/*Напишите программу, которая читает из входного потока целое число в переменную count типа int.
В каждом байте переменной count нужно выключить 7-й, 6-й и 1-й биты (нумерация бит в байте: 7, 6, 5, 4, 3, 2, 1, 0).
Вывести в консоль полученное значение count в виде одного целого числа.*/

#include <stdio.h>

int main(void) {
    int count;
    
    scanf("%d", &count); // Чтение целого числа из входного потока
    
    int result = 0; // Переменная для хранения результата
    
    // Установка битов 7, 6 и 1 в каждом байте переменной count
    for (int i = 0; i < sizeof(count); ++i) {
        // Сохраняем значение текущего байта
        unsigned char byte = (count >> (i * 8)) & 0xFF;
        
        // Очищаем биты 7, 6 и 1 в байте
        byte &= ~(1 << 7); // очищаем 7-й бит
        byte &= ~(1 << 6); // очищаем 6-й бит
        byte &= ~(1 << 1); // очищаем 1-й бит
        
        result |= byte << (i * 8); // Обновляем результат
    }
    
    printf("%d\n", result);
    
    return 0;
}









